{
    "WEBASSEMBLY": "язык программирования низкого уровня для стековой виртуальной машины, спроектированный как портативная цель компиляции для высокоуровневых языков, таких как Си, C++, C#, Rust, Go.",
    "КОМПИЛЯТОР": "программа, переводящая текст, написанный на языке программирования, в набор машинных кодов.",
    "C": "компилируемый статически типизированный язык программирования общего назначения, разработанный в 1969—1973 годах сотрудником Bell Labs Деннисом Ритчи как развитие языка Би.",
    "RUST": "это мультипарадигмальный статически типизированный язык программирования с открытым исходным кодом, используемый для создания операционных систем, компиляторов и других программно-аппаратных средств.",
    "GO": "компилируемый многопоточный язык программирования, разработанный внутри компании Google.",
    "TINYGO": "это компилятор языка Go, предназначенный для использования в таких областях, как микроконтроллеры, WASM, а также разработки утилит командной строки.",
    "JAVASCRIPT": "мультипарадигменный язык программирования. Поддерживает объектно-ориентированный, императивный и функциональный стили. Является реализацией спецификации ECMAScript (стандарт ECMA-262).",
    "СТЕК": "абстрактный тип данных, представляющий собой список элементов, организованных по принципу LIFO (англ. last in — first out, «последним пришёл — первым вышел»).",
    "МОДУЛЬ": "это обособленная часть WASM-программы, которая может связываться и взаимодействовать с другими модулями, и каждый из которых может иметь “основную” (main) функцию.",
    "ПЕРЕМЕННАЯ": "это именованная область памяти, где хранятся данные, с которыми производятся в программе определенные операции, действия и которые могут изменяться при выполнении программы.",
    "ЛОКАЛЬНАЯ ПЕРЕМЕННАЯ": "это переменная область видимости которой начинается в точке её объявления и заканчивается в конце блока, где она была объявлена.", 
    "ГЛОБАЛЬНАЯ ПЕРЕМЕННАЯ": "это переменная, областью видимости которой является вся программа, если только она не перекрыта.", 
    "ПАМЯТЬ": "произвольно доступный массив байтов, в котором мы можем хранить все, что захотим.",
    "ЭЛЕМЕНТЫ": "«дескрипторы» для непрозрачных внешних значений (например, дескрипторы файлов ОС.)",
    "РАЗДЕЛ": "это составляющая модуля WASM, которая содержит определенную информацию о нем.",
    "TYPE": "это раздел модуля WASM, содержащий объявления сигнатур функций", 
    "IMPORT": "это раздел модуля WASM, содержащий объявления заимствований", 
    "FUNCTION": "это раздел модуля WASM, содержащий объявления функций", 
    "TABLE": "это раздел модуля WASM, содержащий таблицу косвенных функций и другие таблицы", 
    "MEMORY": "это раздел модуля WASM, содержащий атрибуты памяти", 
    "GLOBAL": "это раздел модуля WASM, содержащий информацию о глобальном разделе", 
    "EXPORT": "это раздел модуля WASM, содержащий объявления экспортируемых элементов", 
    "START": "это раздел модуля WASM, содержащий информацию о стартовом разделе", 
    "ELEMENT": "это раздел модуля WASM, содержащий информацию об элементах (дескрипторах)", 
    "CODE": "это раздел модуля WASM, содержащий тело функции", 
    "DATA": "это раздел модуля WASM, содержащий сегмент данных"
}